import { Markup } from 'telegraf';

export const MESSAGES = {
  UNREGISTERED_USER: (origin: string) => ({
    text: `
🚀 Привіт! 

Щоб користуватись цим Telegram-ботом, спершу потрібно підключити його у своєму особистому кабінеті на сайті 🌐.

🛠 Інструкція:
1️⃣ Зайдіть у ваш особистий кабінет.
2️⃣ Перейдіть у розділ "Налаштування".
3️⃣ Активуйте Telegram-бота за посиланням нижче:

👉 ${origin}

Після активації ви зможете отримувати повідомлення, керувати своїм акаунтом та користуватись всіма функціями бота 🎉

Дякуємо, що ви з нами! 💛
    `,
    options: Markup.removeKeyboard(), // клавіатура схована
  }),

  WELCOME_BACK: '🎉 Раді бачити вас знову! Оберіть одну з опцій нижче 👇',
  UNKNOWN_COMMAND: '🤔 Вибачте, я не розумію цю команду. Спробуйте ще раз або натисніть кнопку нижче 👇',
};
